experiments/results/baseline-jaeger/raw/20260623_224300_compose-post_R1000_t4_c40_d60.txt
# workload=compose-post
# rate=1000
# threads=4
# connections=40
# duration=60
# timestamp=20260623_224300

Running 1m test @ http://localhost:8080/wrk2-api/post/compose
  4 threads and 40 connections

  Thread calibration: mean lat.: 4.568ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.629ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.506ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 4.563ms, rate sampling interval: 12ms

-----------------------------------------------------------------------
Test Results @ http://localhost:8080/wrk2-api/post/compose 
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     7.63ms   14.13ms  79.36ms   96.33%
    Req/Sec   259.92    148.31   636.00     61.58%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    4.74ms
 75.000%    6.45ms
 90.000%    9.67ms
 99.000%   79.36ms
 99.900%  178.05ms
 99.990%  223.87ms
 99.999%  261.38ms
100.000%  261.38ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       2.501     0.000000            1         1.00
       3.383     0.100000         5010         1.11
       3.701     0.200000         9984         1.25
       4.007     0.300000        14968         1.43
       4.339     0.400000        19949         1.67
       4.739     0.500000        24945         2.00
       4.971     0.550000        27447         2.22
       5.239     0.600000        29958         2.50
       5.559     0.650000        32427         2.86
       5.951     0.700000        34910         3.33
       6.451     0.750000        37402         4.00
       6.759     0.775000        38652         4.44
       7.119     0.800000        39896         5.00
       7.531     0.825000        41145         5.71
       8.047     0.850000        42388         6.67
       8.759     0.875000        43649         8.00
       9.183     0.887500        44264         8.89
       9.671     0.900000        44887        10.00
      10.343     0.912500        45510        11.43
      11.407     0.925000        46128        13.33
      12.871     0.937500        46754        16.00
      13.919     0.943750        47066        17.78
      15.487     0.950000        47375        20.00
      17.919     0.956250        47688        22.86
      21.343     0.962500        47999        26.67
      26.175     0.968750        48310        32.00
      29.871     0.971875        48467        35.56
      34.271     0.975000        48622        40.00
      39.615     0.978125        48778        45.71
      45.919     0.981250        48933        53.33
      55.007     0.984375        49090        64.00
      60.287     0.985938        49167        71.11
      66.687     0.987500        49245        80.00
      74.623     0.989062        49323        91.43
      83.967     0.990625        49402       106.67
      95.039     0.992188        49480       128.00
      99.647     0.992969        49518       142.22
     106.559     0.993750        49557       160.00
     112.639     0.994531        49596       182.86
     120.575     0.995313        49636       213.33
     129.151     0.996094        49675       256.00
     133.375     0.996484        49693       284.44
     138.111     0.996875        49714       320.00
     144.767     0.997266        49733       365.71
     151.679     0.997656        49752       426.67
     157.695     0.998047        49771       512.00
     159.487     0.998242        49781       568.89
     166.527     0.998437        49791       640.00
     170.111     0.998633        49800       731.43
     175.103     0.998828        49810       853.33
     179.967     0.999023        49820      1024.00
     182.527     0.999121        49825      1137.78
     185.727     0.999219        49830      1280.00
     189.055     0.999316        49834      1462.86
     191.487     0.999414        49839      1706.67
     193.535     0.999512        49844      2048.00
     196.863     0.999561        49847      2275.56
     198.783     0.999609        49850      2560.00
     199.167     0.999658        49851      2925.71
     201.471     0.999707        49854      3413.33
     205.567     0.999756        49856      4096.00
     209.919     0.999780        49858      4551.11
     210.943     0.999805        49859      5120.00
     211.199     0.999829        49860      5851.43
     216.063     0.999854        49861      6826.67
     217.983     0.999878        49862      8192.00
     223.871     0.999890        49863      9102.22
     223.999     0.999902        49864     10240.00
     223.999     0.999915        49864     11702.86
     227.967     0.999927        49865     13653.33
     227.967     0.999939        49865     16384.00
     233.599     0.999945        49866     18204.44
     233.599     0.999951        49866     20480.00
     233.599     0.999957        49866     23405.71
     250.239     0.999963        49867     27306.67
     250.239     0.999969        49867     32768.00
     250.239     0.999973        49867     36408.89
     250.239     0.999976        49867     40960.00
     250.239     0.999979        49867     46811.43
     261.375     0.999982        49868     54613.33
     261.375     1.000000        49868          inf
#[Mean    =        7.628, StdDeviation   =       14.128]
#[Max     =      261.248, Total count    =        49868]
#[Buckets =           27, SubBuckets     =         2048]
-----------------------------------------------------------------------
  59537 requests in 1.00m, 12.21MB read
Requests/sec:    992.17  
Transfer/sec:    208.32KB

# docker compose ps
NAME                                     IMAGE                                                COMMAND                  SERVICE                  CREATED        STATUS             PORTS
socialnetwork-compose-post-service-1     deathstarbench/social-network-microservices:latest   "ComposePostService"     compose-post-service     11 hours ago   Up About an hour   
socialnetwork-home-timeline-redis-1      redis                                                "docker-entrypoint.s…"   home-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-home-timeline-service-1    deathstarbench/social-network-microservices:latest   "HomeTimelineService"    home-timeline-service    11 hours ago   Up About an hour   
socialnetwork-jaeger-agent-1             jaegertracing/all-in-one:1.62.0                      "/go/bin/all-in-one-…"   jaeger-agent             11 hours ago   Up About an hour   4317-4318/tcp, 5775/udp, 5778/tcp, 9411/tcp, 14250/tcp, 14268/tcp, 6831-6832/udp, 0.0.0.0:16686->16686/tcp, [::]:16686->16686/tcp
socialnetwork-media-frontend-1           yg397/media-frontend:xenial                          "/usr/local/openrest…"   media-frontend           11 hours ago   Up About an hour   0.0.0.0:8081->8080/tcp, [::]:8081->8080/tcp
socialnetwork-media-memcached-1          memcached                                            "docker-entrypoint.s…"   media-memcached          11 hours ago   Up About an hour   11211/tcp
socialnetwork-media-mongodb-1            mongo:4.4.6                                          "docker-entrypoint.s…"   media-mongodb            11 hours ago   Up About an hour   27017/tcp
socialnetwork-media-service-1            deathstarbench/social-network-microservices:latest   "MediaService"           media-service            11 hours ago   Up About an hour   
socialnetwork-nginx-thrift-1             yg397/openresty-thrift:xenial                        "/usr/local/openrest…"   nginx-thrift             11 hours ago   Up About an hour   0.0.0.0:8080->8080/tcp, [::]:8080->8080/tcp
socialnetwork-post-storage-memcached-1   memcached                                            "docker-entrypoint.s…"   post-storage-memcached   11 hours ago   Up About an hour   11211/tcp
socialnetwork-post-storage-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   post-storage-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-post-storage-service-1     deathstarbench/social-network-microservices:latest   "PostStorageService"     post-storage-service     11 hours ago   Up About an hour   0.0.0.0:10002->9090/tcp, [::]:10002->9090/tcp
socialnetwork-social-graph-mongodb-1     mongo:4.4.6                                          "docker-entrypoint.s…"   social-graph-mongodb     11 hours ago   Up About an hour   27017/tcp
socialnetwork-social-graph-redis-1       redis                                                "docker-entrypoint.s…"   social-graph-redis       11 hours ago   Up About an hour   6379/tcp
socialnetwork-social-graph-service-1     deathstarbench/social-network-microservices:latest   "SocialGraphService"     social-graph-service     11 hours ago   Up About an hour   
socialnetwork-text-service-1             deathstarbench/social-network-microservices:latest   "TextService"            text-service             11 hours ago   Up About an hour   
socialnetwork-unique-id-service-1        deathstarbench/social-network-microservices:latest   "UniqueIdService"        unique-id-service        11 hours ago   Up About an hour   
socialnetwork-url-shorten-memcached-1    memcached                                            "docker-entrypoint.s…"   url-shorten-memcached    11 hours ago   Up About an hour   11211/tcp
socialnetwork-url-shorten-mongodb-1      mongo:4.4.6                                          "docker-entrypoint.s…"   url-shorten-mongodb      11 hours ago   Up About an hour   27017/tcp
socialnetwork-url-shorten-service-1      deathstarbench/social-network-microservices:latest   "UrlShortenService"      url-shorten-service      11 hours ago   Up About an hour   
socialnetwork-user-memcached-1           memcached                                            "docker-entrypoint.s…"   user-memcached           11 hours ago   Up About an hour   11211/tcp
socialnetwork-user-mention-service-1     deathstarbench/social-network-microservices:latest   "UserMentionService"     user-mention-service     11 hours ago   Up About an hour   
socialnetwork-user-mongodb-1             mongo:4.4.6                                          "docker-entrypoint.s…"   user-mongodb             11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-service-1             deathstarbench/social-network-microservices:latest   "UserService"            user-service             11 hours ago   Up About an hour   
socialnetwork-user-timeline-mongodb-1    mongo:4.4.6                                          "docker-entrypoint.s…"   user-timeline-mongodb    11 hours ago   Up About an hour   27017/tcp
socialnetwork-user-timeline-redis-1      redis                                                "docker-entrypoint.s…"   user-timeline-redis      11 hours ago   Up About an hour   6379/tcp
socialnetwork-user-timeline-service-1    deathstarbench/social-network-microservices:latest   "UserTimelineService"    user-timeline-service    11 hours ago   Up About an hour